; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v7 ?v1)
             (pred_3 ?v4 ?v9)
             (pred_5 ?v7 ?v9)
             (pred_9 ?v13 ?v7 )
	     (pred_8 ?v7)
             (pred_6 ?v12)
             (pred_10 ?v4)
             (pred_12 ?v9)
             (pred_7 ?v7)
             (pred_11 ?v4)
             (pred_4 ?v7)
             (pred_1 ))



(:action op_4
:parameters (?v3 ?v2 ?v6 ?v11)
:precondition (and (pred_6 ?v3) (pred_6 ?v2) (pred_10 ?v6) (pred_12 ?v11)
          (pred_2 ?v3 ?v2) (pred_3 ?v6 ?v11)
                   (pred_5 ?v2 ?v11) (pred_8 ?v3) 
                   (pred_7 ?v2) (pred_11 ?v6))
:effect (and  (pred_4 ?v2) (not (pred_7 ?v2))))


(:action op_2
:parameters (?v3 ?v8)
:precondition (and (pred_6 ?v3) (pred_6 ?v8)
               (pred_8 ?v3) (pred_2 ?v3 ?v8) (pred_4 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v3))))

(:action op_5
:parameters (?v3 ?v6)
:precondition (and (pred_6 ?v3) (pred_10 ?v6) 
                  (pred_8 ?v3) (pred_9 ?v6 ?v3) (pred_1 ))
:effect (and (pred_11 ?v6)
   (not (pred_9 ?v6 ?v3)) (not (pred_1 ))))


(:action op_3
:parameters (?v3 ?v10 ?v5)
:precondition (and (pred_6 ?v3) (pred_10 ?v10) (pred_10 ?v5)
                  (pred_8 ?v3) (pred_11 ?v5) (pred_9 ?v10 ?v3))
:effect (and (pred_11 ?v10) (pred_9 ?v5 ?v3)
        (not (pred_11 ?v5)) (not (pred_9 ?v10 ?v3))))

(:action op_1
:parameters (?v3 ?v6)
:precondition (and (pred_6 ?v3) (pred_10 ?v6) 
                  (pred_8 ?v3) (pred_11 ?v6))
:effect (and (pred_1 ) (pred_9 ?v6 ?v3) (not (pred_11 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_04 obj_18 obj_06 obj_15 obj_02 obj_21 obj_20 obj_07 obj_10 obj_12 obj_17 obj_13 obj_05 obj_09 obj_03
    obj_14 obj_08
    obj_16 obj_01 obj_11
    )

    (:init
       (pred_1)

       (pred_6 obj_19)
       (pred_6 obj_04)
       (pred_6 obj_18)
       (pred_6 obj_06)
       (pred_6 obj_15)
       (pred_6 obj_02)
       (pred_6 obj_21)
       (pred_6 obj_20)
       (pred_6 obj_07)
       (pred_6 obj_10)
       (pred_6 obj_12)
       (pred_6 obj_17)
       (pred_6 obj_13)
       (pred_6 obj_05)
       (pred_6 obj_09)
       (pred_6 obj_03)
       (pred_12 obj_14)
       (pred_12 obj_08)
       (pred_10 obj_16)
       (pred_10 obj_01)
       (pred_10 obj_11)

       (pred_2 obj_19 obj_15)
       (pred_2 obj_19 obj_04)
       (pred_2 obj_04 obj_02)
       (pred_2 obj_04 obj_18)
       (pred_2 obj_04 obj_19)
       (pred_2 obj_18 obj_21)
       (pred_2 obj_18 obj_06)
       (pred_2 obj_18 obj_04)
       (pred_2 obj_06 obj_20)
       (pred_2 obj_06 obj_18)
       (pred_2 obj_15 obj_07)
       (pred_2 obj_15 obj_02)
       (pred_2 obj_15 obj_19)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_02 obj_21)
       (pred_2 obj_02 obj_04)
       (pred_2 obj_02 obj_15)
       (pred_2 obj_21 obj_12)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_21 obj_18)
       (pred_2 obj_21 obj_02)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_20 obj_06)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_07 obj_13)
       (pred_2 obj_07 obj_10)
       (pred_2 obj_07 obj_15)
       (pred_2 obj_10 obj_05)
       (pred_2 obj_10 obj_12)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_10 obj_07)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_12 obj_17)
       (pred_2 obj_12 obj_21)
       (pred_2 obj_12 obj_10)
       (pred_2 obj_17 obj_03)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_17 obj_12)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_05 obj_09)
       (pred_2 obj_05 obj_10)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_09 obj_03)
       (pred_2 obj_09 obj_12)
       (pred_2 obj_09 obj_05)
       (pred_2 obj_03 obj_17)
       (pred_2 obj_03 obj_09)
       (pred_7 obj_20)
       (pred_7 obj_21)
       (pred_7 obj_12)
       (pred_5  obj_20 obj_14)
       (pred_5  obj_21 obj_08)
       (pred_5  obj_12 obj_08)
       (pred_4 obj_19)
       (pred_4 obj_04)
       (pred_4 obj_18)
       (pred_4 obj_06)
       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_4 obj_07)
       (pred_4 obj_10)
       (pred_4 obj_17)
       (pred_4 obj_13)
       (pred_4 obj_05)
       (pred_4 obj_09)
       (pred_4 obj_03)

       (pred_3  obj_16 obj_14)
       (pred_3  obj_01 obj_08)
       (pred_3  obj_11 obj_08)
       (pred_9 obj_16 obj_03)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_11 obj_17)
       (pred_8 obj_13)
    )

    (:goal (and
       (pred_9 obj_01 obj_06)
    ))
(:constraints
  (always (not (pred_8 obj_07)))
)
)

; plan
1. (op_2 obj_13 obj_05)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_05)
   goals met: 0 of 1
2. (op_2 obj_05 obj_10)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_10)
   goals met: 0 of 1
3. (op_2 obj_10 obj_02)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_02)
   goals met: 0 of 1
4. (op_2 obj_02 obj_04)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_04)
   goals met: 0 of 1
5. (op_2 obj_04 obj_19)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_19)
   goals met: 0 of 1
6. (op_5 obj_19 obj_01)
   deleted: (pred_9 obj_01 obj_19) (pred_1)
   added: (pred_11 obj_01)
   goals met: 0 of 1
7. (op_2 obj_19 obj_04)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_04)
   goals met: 0 of 1
8. (op_2 obj_04 obj_18)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_18)
   goals met: 0 of 1
9. (op_2 obj_18 obj_06)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_06)
   goals met: 0 of 1
10. (op_1 obj_06 obj_01)
   deleted: (pred_11 obj_01)
   added: (pred_1) (pred_9 obj_01 obj_06)
   goals met: 1 of 1
